redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_pdm.c
/****************************************************************************
 * arch/arm/src/nrf52/nrf52_pdm.c
 *
 *   Copyright (C) 2018 zGlue Inc. All rights reserved.
 *   Author: Zhengwei Wang <zhengwei@zglue.com>
 *
 * References:
 *
 * -  The framework for this driver is based on stm32l4_sai driver
 *    written by Gregory Nutt.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <semaphore.h>
#include <errno.h>
#include <assert.h>
#include <queue.h>
#include <debug.h>

#include <arch/board/board.h>

#include <nuttx/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/clock.h>
#include <nuttx/wqueue.h>
#include <nuttx/fs/fs.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/audio/audio.h>

#include <arch/board/board.h>


#include "chip.h"
#include "nrf.h"
#include "nrf_pdm.h"
#include "nrf_gpio.h"
#include "nrf52_gpio.h"
#include "nrf52_pdm.h"

#ifdef CONFIG_NRF52_PDM

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifndef CONFIG_SCHED_WORKQUEUE
#  error Work queue support is required (CONFIG_SCHED_WORKQUEUE)
#endif

#ifndef CONFIG_AUDIO
#  error CONFIG_AUDIO required by this driver
#endif

#ifndef CONFIG_PDM
#  error CONFIG_PDM required by this driver
#endif

#ifndef CONFIG_NRF52_PDM_GAINL
#define CONFIG_NRF52_PDM_GAINL 0x28
#endif

#ifndef CONFIG_NRF52_PDM_GAINR
#define CONFIG_NRF52_PDM_GAINR 0x28
#endif

#ifndef CONFIG_NRF52_PDM_DEFAULT_CHANNEL
#  define CONFIG_NRF52_PDM_DEFAULT_CHANNEL     (2)
#endif


#ifndef CONFIG_NRF52_PDM_MAXINFLIGHT
#  define CONFIG_NRF52_PDM_MAXINFLIGHT         (16)
#endif

/* NRF52 PDM peripheral only support 16kHZ samplerate and 16bit sample length */
#define NRF52_PDM_SAMPLERATE    16000
#define NRF52_PDM_SAMPLELENGTH  16

#define NRF52_PDM_DATA_ALIGN 1

#define EVT_TO_STR(event)   (event == NRF_PDM_EVENT_STARTED ? "NRF_PDM_EVENT_STARTED" : \
                            (event == NRF_PDM_EVENT_STOPPED ? "NRF_PDM_EVENT_STOPPED" : \
                            (event == NRF_PDM_EVENT_END ? "NRF_PDM_EVENT_END" : "UNKNOWN EVENT")))

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* PDM buffer container */

struct pdm_buffer_s
{
  struct pdm_buffer_s *flink;  /* Supports a singly linked list */
  pdm_callback_t callback;     /* Function to call when the transfer completes */
  uint32_t timeout;            /* The timeout value to use with transfers */
  void *arg;                   /* The argument to be returned with the callback */
  struct ap_buffer_s *apb;     /* The audio buffer */
  int result;                  /* The result of the transfer */
};


/* The state of the one PDM peripheral */

struct nrf52_pdm_s
{
  struct pdm_dev_s dev;        /* Externally visible PDM interface */
  sem_t exclsem;               /* Assures mutually exclusive acess to pdm */
  sq_queue_t pend;             /* A queue of pending transfers */
  sq_queue_t done;             /* A queue of completed transfers */
  struct work_s work;          /* this work will clear all apb buffers in the done queue */

  /* PDM setting */
  uint8_t channel;             /* mono or stereo */
  uint8_t channel_setted;      /* new setted channel number */
  bool receiving;

  /* Pre-allocated pool of buffer containers */

  sem_t bufsem;                   /* Buffer wait semaphore */
  struct pdm_buffer_s *freelist;  /* A list a free buffer containers */
  struct pdm_buffer_s containers[CONFIG_NRF52_PDM_MAXINFLIGHT];

  struct pdm_buffer_s *working;/*point to the apb_buffer that is using currently by the pdm*/
  struct pdm_buffer_s *loaded;/*point to the apb_buffer that has been just handded over to pdm peripheral*/
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Semaphore helpers */

static void     nrf52_pdm_exclsem_take(struct nrf52_pdm_s *priv);
#define         nrf52_pdm_exclsem_give(priv) sem_post(&priv->exclsem)

static void     nrf52_pdm_bufsem_take(struct nrf52_pdm_s *priv);
#define         nrf52_pdm_bufsem_give(priv) sem_post(&priv->bufsem)

