redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_pdm.c
/* Buffer container helpers */

static struct pdm_buffer_s *nrf52_pdm_buf_allocate(struct nrf52_pdm_s *priv);
static void     nrf52_pdm_buf_free(struct nrf52_pdm_s *priv,
                                   struct pdm_buffer_s *bfcontainer);
static void     nrf52_pdm_buf_initialize(struct nrf52_pdm_s *priv);

/*interrupt handler*/
static int      nrf52_pdm_interrupt(int irq, FAR void *context, FAR void *arg);


/* PDM methods */

static uint32_t nrf52_pdm_samplerate(struct pdm_dev_s *dev, uint32_t rate);
static uint32_t nrf52_pdm_datawidth(struct pdm_dev_s *dev, int bits);
static uint32_t nrf52_pdm_channel(struct pdm_dev_s *dev, int channel);
static int      nrf52_pdm_receive(struct pdm_dev_s *dev, struct ap_buffer_s *apb,
                                  pdm_callback_t callback, void *arg, uint32_t timeout);
static int      nrf52_pdm_send(struct pdm_dev_s *dev, struct ap_buffer_s *apb,
                               pdm_callback_t callback, void *arg,
                               uint32_t timeout);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* PDM device operations */

static const struct pdm_ops_s g_pdmops =
{
  /* Receiver methods */

  .pdm_rxsamplerate = nrf52_pdm_samplerate,
  .pdm_rxdatawidth  = nrf52_pdm_datawidth,
  .pdm_rxchannel    = nrf52_pdm_channel,
  .pdm_receive      = nrf52_pdm_receive,

  /* Transmitter methods */

  .pdm_txsamplerate = nrf52_pdm_samplerate,
  .pdm_txdatawidth  = nrf52_pdm_datawidth,
  .pdm_txchannel    = nrf52_pdm_channel,
  .pdm_send         = nrf52_pdm_send,
};

/* pdm status */
static struct nrf52_pdm_s g_nrf52_pdm_priv =
{
  .dev.ops     = &g_pdmops,
  .channel     = CONFIG_NRF52_PDM_DEFAULT_CHANNEL,
  .channel_setted = CONFIG_NRF52_PDM_DEFAULT_CHANNEL,
  .receiving = false,
  .loaded = NULL,
  .working = NULL,
};

#define PDM_NULL_BUFFER_LENGTH 4
static uint16_t pdm_null_buffer[PDM_NULL_BUFFER_LENGTH] = {0, 0, 0, 0};


/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf52_pdm_getbitrate
 *
 * Description:
 *   Get the currently configured bitrate
 *
 * Input Parameters:
 *   priv   - private PDM device structure
 *
 * Returned Value:
 *   The current bitrate
 *
 ****************************************************************************/

static inline uint32_t nrf52_pdm_getbitrate(struct nrf52_pdm_s *priv)
{
  /* Calculate the bitrate in Hz */

  return priv->channel * NRF52_PDM_SAMPLERATE * NRF52_PDM_SAMPLELENGTH;
}

/****************************************************************************
 * Name: nrf52_pdm_exclsem_take
 *
 * Description:
 *   Take the exclusive access semaphore handling any exceptional conditions
 *
 * Input Parameters:
 *   priv - A reference to the PDM peripheral state
 *
 * Returned Value:
 *  None
 *
 ****************************************************************************/

static void nrf52_pdm_exclsem_take(struct nrf52_pdm_s *priv)
{
  int ret;

  /* Wait until we successfully get the semaphore.  EINTR is the only
   * expected 'failure' (meaning that the wait for the semaphore was
   * interrupted by a signal).
   */

  do
    {
      ret = sem_wait(&priv->exclsem);
      DEBUGASSERT(ret == 0 || errno == EINTR);
    }
  while (ret < 0);
}


/****************************************************************************
 * Name: nrf52_pdm_reload
 *
 * Description:
 *   updata the buffer address of PDM peripheral
 *
 * Input Parameters:
 *   priv - nrf52 pdm device instance
 *   container -- new buffer that will be loaded to PDM peripheral
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 *
 ****************************************************************************/

static int nrf52_pdm_reload(struct nrf52_pdm_s *priv, struct pdm_buffer_s *container)
{
  struct ap_buffer_s *apb;
  uintptr_t samp;
  apb_samp_t nbytes;


  if (container)
    {
      apb = container->apb;

      /* Get the transfer information, accounting for any data offset */

      samp = (uintptr_t)&apb->samp[apb->curbyte];
      nbytes = apb->nmaxbytes - apb->curbyte;

      DEBUGASSERT((samp & NRF52_PDM_DATA_ALIGN) == 0 && (nbytes & NRF52_PDM_DATA_ALIGN) == 0);

      /*reload target buffer*/

      nrf_pdm_buffer_set((uint32_t *)samp, nbytes / 2);

    }
  else
    {
      nrf_pdm_buffer_set((uint32_t *)pdm_null_buffer, PDM_NULL_BUFFER_LENGTH);
    }

  priv->working = priv->loaded;
  priv->loaded = container;

  return OK;

}



/****************************************************************************
 * Name: nrf52_pdm_start
 *
 * Description:
 *   Setup and start pdm transfer
 *
 * Input Parameters:
 *   priv - nrf52 pdm device instance
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 * Assumptions:
 *   Interrupts are disabled and the PDM peripheral is in idle status
 *
 ****************************************************************************/
static int nrf52_pdm_start(struct nrf52_pdm_s *priv)
{
  struct pdm_buffer_s *bfcontainer;
  nrf_pdm_mode_t pdm_channel;
  nrf_pdm_edge_t pdm_edge;
  irqstate_t flags;

  /* If there are no pending transfer, then bail returning success */

  if (sq_empty(&priv->pend))
    {
      return OK;
    }


  flags = enter_critical_section();

  bfcontainer = (struct pdm_buffer_s *)sq_remfirst(&priv->pend);
  DEBUGASSERT(bfcontainer && bfcontainer->apb);

  leave_critical_section(flags);

  /*set channel*/

  nrf_pdm_mode_get(&pdm_channel, &pdm_edge);
  pdm_channel = (priv->channel_setted == 2) ? NRF_PDM_MODE_STEREO : NRF_PDM_MODE_MONO;
  nrf_pdm_mode_set(pdm_channel, pdm_edge);
  priv->channel = priv->channel_setted;

  /*set the new buffer as the PDM TX/RX buffer*/

  nrf52_pdm_reload(priv, bfcontainer);

