redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_pdm.c
  //clear event
  nrf_pdm_event_clear(NRF_PDM_EVENT_STARTED);
  nrf_pdm_event_clear(NRF_PDM_EVENT_STOPPED);
  nrf_pdm_event_clear(NRF_PDM_EVENT_END);

  /*enable pdm*/

  nrf_pdm_enable();

  /*trigger start task*/

  nrf_pdm_task_trigger(NRF_PDM_TASK_START);

  /*enable PDM interrupt*/

  up_enable_irq(PDM_IRQn);


  return OK;
}

/****************************************************************************
 * Name: nrf52_pdm_clear_worker
 *
 * Description:
 *   Transfer done worker
 *
 * Input Parameters:
 *   arg - the PDM device instance cast to void*
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void nrf52_pdm_clear_worker(void *arg)
{
  struct nrf52_pdm_s *priv = (struct nrf52_pdm_s *)arg;
  struct pdm_buffer_s *bfcontainer;
  irqstate_t flags;

  DEBUGASSERT(priv);

  /* Process each buffer in the done queue */

  while (sq_peek(&priv->done) != NULL)
    {
      /* Remove the buffer container from the done queue.  NOTE that
       * interupts must be enabled to do this because the done queue is
       * also modified from the interrupt level.
       */

      flags = enter_critical_section();
      bfcontainer = (struct pdm_buffer_s *)sq_remfirst(&priv->done);
      leave_critical_section(flags);

      /* Perform the transfer done callback */

      DEBUGASSERT(bfcontainer && bfcontainer->callback);
      bfcontainer->callback(&priv->dev, bfcontainer->apb,
                            bfcontainer->arg, bfcontainer->result);

      /* Release our reference on the audio buffer.  This may very likely
       * cause the audio buffer to be freed.
       */

      apb_free(bfcontainer->apb);

      /* And release the buffer container */

      nrf52_pdm_buf_free(priv, bfcontainer);
    }

}

/****************************************************************************
 * Name: nrf52_pdm_interrupt
 *
 * Description:
 *   This callback function is invoked at the completion of the PDM transfer.
 *
 * Input Parameters:
 *   handle - The DMA handler
 *   isr    - The interrupt status of the DMA transfer
 *   arg    - A pointer to the nrf52 pdm device instance
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
int nrf52_pdm_interrupt(int irq, FAR void *context, FAR void *arg)
{
  struct nrf52_pdm_s *priv = (struct nrf52_pdm_s *)arg;
  struct pdm_buffer_s *bfcontainer;
  int ret;

  DEBUGASSERT(priv);

  if (nrf_pdm_event_check(NRF_PDM_EVENT_END))
    {
      nrf_pdm_event_clear(NRF_PDM_EVENT_END);
      audinfo("Event: %s.\r\n", (uint32_t)EVT_TO_STR(NRF_PDM_EVENT_END));


      /*priv->working now pointed to the container which has just finished the transfer*/

      bfcontainer = priv->working;

      if (bfcontainer != NULL)
        {
          /*set the apb->nbytes to tell the user how many bytes we have received*/

          bfcontainer->apb->nbytes = bfcontainer->apb->nmaxbytes;

          /* Report the result of the transfer */

          bfcontainer->result = OK;

          /* Add the completed buffer container to the tail of the done queue */

          sq_addlast((sq_entry_t *)bfcontainer, &priv->done);
        }

      /* If the worker has completed running, then reschedule the working thread.
       * REVISIT:  There may be a race condition here.  So we do nothing is the
       * worker is not available.
       */

      if ((!sq_empty(&priv->done)) && work_available(&priv->work))
        {
          /* Schedule the done processing to occur on the worker thread. */

          ret = work_queue(LPWORK, &priv->work, nrf52_pdm_clear_worker, priv, 0);
          if (ret != 0)
            {
              pdmerr("ERROR: Failed to queue work: %d\n", ret);
            }
        }
    }
  else if (nrf_pdm_event_check(NRF_PDM_EVENT_STARTED))
    {
      nrf_pdm_event_clear(NRF_PDM_EVENT_STARTED);
      audinfo("Event: %s.\r\n", (uint32_t)EVT_TO_STR(NRF_PDM_EVENT_STARTED));

      DEBUGASSERT((priv->loaded != NULL)  || (priv->working != NULL));

      if (priv->loaded == NULL)
        {
          bfcontainer = NULL;
          /*priv->loaded == NULL means we have already handled
           *the last meaningful buffer and we are OK to trigger the stop task.
           */
          nrf_pdm_task_trigger(NRF_PDM_TASK_STOP);
        }
      else
        {
          if (sq_empty(&priv->pend))
            {
              bfcontainer = NULL;
            }
          else
            {
              /*If the configration is changed, we will trigger a stop task and update the PDM
              register when we restart.*/
              if (priv->channel_setted != priv->channel)
                {
                  bfcontainer = NULL;
                }
              else
                {
                  bfcontainer = (struct pdm_buffer_s *)sq_remfirst(&priv->pend);
                }
            }

        }




      nrf52_pdm_reload(priv, bfcontainer);


    }
  else if (nrf_pdm_event_check(NRF_PDM_EVENT_STOPPED))
    {
      nrf_pdm_event_clear(NRF_PDM_EVENT_STOPPED);
      audinfo("Event: %s.\r\n", (uint32_t)EVT_TO_STR(NRF_PDM_EVENT_STOPPED));

      DEBUGASSERT((priv->loaded == NULL)  && (priv->working == NULL));
      nrf_pdm_disable();
      up_disable_irq(PDM_IRQn);

      priv->working = NULL;
      priv->loaded = NULL;

      if (sq_empty(&priv->pend))
        {
          priv->receiving = false;
        }
      else
        {
          nrf52_pdm_start(priv);
        }

    }

  return OK;


}


/****************************************************************************
 * Name: nrf52_pdm_samplerate
 *
 * Description:
 *   Set the PDM RX/TX sample rate.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   rate - The PDM sample rate in samples (not bits) per second
 *
 * Returned Value:
 *   Returns the resulting bitrate
 *
 ****************************************************************************/

static uint32_t nrf52_pdm_samplerate(struct pdm_dev_s *dev, uint32_t rate)
{
  struct nrf52_pdm_s *priv = (struct nrf52_pdm_s *)dev;

