redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_pdm.c
  DEBUGASSERT(priv);

  if (rate == NRF52_PDM_SAMPLERATE)
    {
      return nrf52_pdm_getbitrate(priv);
    }
  else
    {
      pdmerr("ERROR: Unsupported or invalid data sample rate: %d\n", rate);
      return 0;
    }

}

/****************************************************************************
 * Name: nrf52_pdm_datawidth
 *
 * Description:
 *   Set the PDM data width.  The bitrate is determined by
 *   channel * sample_rate * data_width.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   width - The PDM data with in bits.
 *
 * Returned Value:
 *   Returns the resulting bitrate
 *
 ****************************************************************************/

static uint32_t nrf52_pdm_datawidth(struct pdm_dev_s *dev, int bits)
{
  struct nrf52_pdm_s *priv = (struct nrf52_pdm_s *)dev;

  DEBUGASSERT(priv);

  if (bits == NRF52_PDM_SAMPLELENGTH)
    {
      return nrf52_pdm_getbitrate(priv);
    }
  else
    {
      pdmerr("ERROR: Unsupported or invalid data width: %d\n", bits);
      return 0;
    }
}

/****************************************************************************
 * Name: nrf52_pdm_channel
 *
 * Description:
 *   Set the PDM channel.  The bitrate is determined by
 *   channel * sample_rate * data_width.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   channel - The PDM channel.
 *
 * Returned Value:
 *   Returns the resulting bitrate
 *
 ****************************************************************************/

static uint32_t nrf52_pdm_channel(struct pdm_dev_s *dev, int channel)
{
  struct nrf52_pdm_s *priv = (struct nrf52_pdm_s *)dev;

  DEBUGASSERT(priv && ((channel == 1) || (channel == 2)));

  /* Save the new data width */

  priv->channel_setted = (uint8_t)channel;
  return nrf52_pdm_getbitrate(priv);
}


/****************************************************************************
 * Name: nrf52_pdm_receive
 *
 * Description:
 *   Receive a block of data from PDM.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   apb      - A pointer to the audio buffer in which to recieve data
 *   callback - A user provided callback function that will be called at
 *              the completion of the transfer.  The callback will be
 *              performed in the context of the worker thread.
 *   arg      - An opaque argument that will be provided to the callback
 *              when the transfer complete
 *   timeout  - The timeout value to use.  The transfer will be canceled
 *              and an ETIMEDOUT error will be reported if this timeout
 *              elapsed without completion of the DMA transfer.  Units
 *              are system clock ticks.  Zero means no timeout.
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure.  NOTE:  This function
 *   only enqueues the transfer and returns immediately.  Success here only
 *   means that the transfer was enqueued correctly.
 *
 *   When the transfer is complete, a 'result' value will be provided as
 *   an argument to the callback function that will indicate if the transfer
 *   failed.
 *
 ****************************************************************************/

static int nrf52_pdm_receive(struct pdm_dev_s *dev, struct ap_buffer_s *apb,
                             pdm_callback_t callback, void *arg, uint32_t timeout)
{
  struct nrf52_pdm_s *priv = (struct nrf52_pdm_s *)dev;
  struct pdm_buffer_s *bfcontainer;
  irqstate_t flags;
  int ret;

  DEBUGASSERT(priv && apb);
  pdminfo("apb=%p nbytes=%d arg=%p timeout=%d\n",
          apb, apb->nmaxbytes - apb->curbyte, arg, timeout);

  /* Allocate a buffer container in advance */

  bfcontainer = nrf52_pdm_buf_allocate(priv);
  DEBUGASSERT(bfcontainer);

  /* Get exclusive access to the SAI driver data */

  nrf52_pdm_exclsem_take(priv);

  /* Add a reference to the audio buffer */

  apb_reference(apb);

  /*we should make the audio sample buffer align to halfword(16bit),
  because it's required by the hardware.*/

  /*apb_realign_to_hword(apb);*/

  /* Initialize the buffer container structure */

  bfcontainer->callback = (void *)callback;
  bfcontainer->timeout  = timeout;
  bfcontainer->arg      = arg;
  bfcontainer->apb      = apb;
  bfcontainer->result   = -EBUSY;

  /* Add the buffer container to the end of the pending queue */

  flags = enter_critical_section();
  sq_addlast((sq_entry_t *)bfcontainer, &priv->pend);
  leave_critical_section(flags);

  /* Then start the next transfer.  If there is already a transfer in progess,
   * then this will do nothing.
   */
  if (priv->receiving == false)
    {
      priv->receiving = true;
      ret = nrf52_pdm_start(priv);
      DEBUGASSERT(ret == OK);
    }

  nrf52_pdm_exclsem_give(priv);

  return OK;
}


/****************************************************************************
 * Name: nrf52_pdm_send
 *
 * Description:
 *   Send a block of data on PDM.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   apb      - A pointer to the audio buffer from which to send data
 *   callback - A user provided callback function that will be called at
 *              the completion of the transfer.  The callback will be
 *              performed in the context of the worker thread.
 *   arg      - An opaque argument that will be provided to the callback
 *              when the transfer complete
 *   timeout  - The timeout value to use.  The transfer will be canceled
 *              and an ETIMEDOUT error will be reported if this timeout
 *              elapsed without completion of the DMA transfer.  Units
 *              are system clock ticks.  Zero means no timeout.
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure.  NOTE:  This function
 *   only enqueues the transfer and returns immediately.  Success here only
 *   means that the transfer was enqueued correctly.
 *
 *   When the transfer is complete, a 'result' value will be provided as
 *   an argument to the callback function that will indicate if the transfer
 *   failed.
 *
 ****************************************************************************/

