redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_pdm.c
static int nrf52_pdm_send(struct pdm_dev_s *dev, struct ap_buffer_s *apb,
                          pdm_callback_t callback, void *arg, uint32_t timeout)
{

  /* nrf52 PDM peripheral only supports data input, data output is not supported*/

  return -ENODEV;
}

/****************************************************************************
 * Name: nrf52_pdm_bufsem_take
 *
 * Description:
 *   Take the buffer semaphore handling any exceptional conditions
 *
 * Input Parameters:
 *   priv - A reference to the PDM peripheral state
 *
 * Returned Value:
 *  None
 *
 ****************************************************************************/

static void nrf52_pdm_bufsem_take(struct nrf52_pdm_s *priv)
{
  int ret;

  /* Wait until we successfully get the semaphore.  EINTR is the only
   * expected 'failure' (meaning that the wait for the semaphore was
   * interrupted by a signal).
   */

  do
    {
      ret = sem_wait(&priv->bufsem);
      DEBUGASSERT(ret == 0 || errno == EINTR);
    }
  while (ret < 0);
}

/****************************************************************************
 * Name: nrf52_pdm_buf_allocate
 *
 * Description:
 *   Allocate a buffer container by removing the one at the head of the
 *   free list
 *
 * Input Parameters:
 *   priv - nrf52 pdm device instance
 *
 * Returned Value:
 *   A non-NULL pointer to the allocate buffer container on success; NULL if
 *   there are no available buffer containers.
 *
 * Assumptions:
 *   The caller does NOT have exclusive access to the nrf52 pdm device structure.
 *   That would result in a deadlock!
 *
 ****************************************************************************/

static struct pdm_buffer_s *nrf52_pdm_buf_allocate(struct nrf52_pdm_s *priv)
{
  struct pdm_buffer_s *bfcontainer;
  irqstate_t flags;

  /* Set aside a buffer container.  By doing this, we guarantee that we will
   * have at least one free buffer container.
   */

  nrf52_pdm_bufsem_take(priv);

  /* Get the buffer from the head of the free list */

  flags = enter_critical_section();
  bfcontainer = priv->freelist;
  ASSERT(bfcontainer);

  /* Unlink the buffer from the freelist */

  priv->freelist = bfcontainer->flink;
  leave_critical_section(flags);
  return bfcontainer;
}

/****************************************************************************
 * Name: nrf52_pdm_buf_free
 *
 * Description:
 *   Free buffer container by adding it to the head of the free list
 *
 * Input Parameters:
 *   priv - nrf52 pdm device instance
 *   bfcontainer - The buffer container to be freed
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The caller has exclusive access to the nrf52 pdm device structure
 *
 ****************************************************************************/

static void nrf52_pdm_buf_free(struct nrf52_pdm_s *priv, struct pdm_buffer_s *bfcontainer)
{
  irqstate_t flags;

  /* Put the buffer container back on the free list */

  flags = enter_critical_section();
  bfcontainer->flink  = priv->freelist;
  priv->freelist = bfcontainer;
  leave_critical_section(flags);

  /* Wake up any threads waiting for a buffer container */

  nrf52_pdm_bufsem_give(priv);
}

/****************************************************************************
 * Name: nrf52_pdm_buf_initialize
 *
 * Description:
 *   Initialize the buffer container allocator by adding all of the
 *   pre-allocated buffer containers to the free list
 *
 * Input Parameters:
 *   priv - nrf52 pdm device instance
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called early in PDM initialization so that there are no issues with
 *   concurrency.
 *
 ****************************************************************************/

static void nrf52_pdm_buf_initialize(struct nrf52_pdm_s *priv)
{
  int i;

  priv->freelist = NULL;
  sem_init(&priv->bufsem, 0, CONFIG_NRF52_PDM_MAXINFLIGHT);

  for (i = 0; i < CONFIG_NRF52_PDM_MAXINFLIGHT; i++)
    {
      nrf52_pdm_buf_free(priv, &priv->containers[i]);
    }
}


/****************************************************************************
 * Name: nrf52_pdm_config
 *
 * Description:
 *   config pdm registers
 *
 * Input Parameter:
 *
 * Returned Value:
 *
 ****************************************************************************/

static void nrf52_pdm_config(void)
{

#ifdef CONFIG_NRF52_PDM_MONO_SAMMPLE_LEFT
  nrf_pdm_mode_set(NRF_PDM_MODE_STEREO, NRF_PDM_EDGE_LEFTFALLING);
#else
  nrf_pdm_mode_set(NRF_PDM_MODE_STEREO, NRF_PDM_EDGE_LEFTRISING);
#endif

  nrf_pdm_clock_set(NRF_PDM_FREQ_1032K);
  nrf_pdm_gain_set(CONFIG_NRF52_PDM_GAINL, CONFIG_NRF52_PDM_GAINR);


  /*clear event*/
  nrf_pdm_event_clear(NRF_PDM_EVENT_STARTED);
  nrf_pdm_event_clear(NRF_PDM_EVENT_STOPPED);
  nrf_pdm_event_clear(NRF_PDM_EVENT_END);

  /*enable pdm interrupt*/
  nrf_pdm_int_enable(NRF_PDM_INT_STARTED | NRF_PDM_INT_END | NRF_PDM_INT_STOPPED);


}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf52_pdm_initialize
 *
 * Description:
 *   Initialize the nrf52 pdm driver
 *
 * Input Parameters:
 *
 * Returned Value:
 *   Valid PDM device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct pdm_dev_s *nrf52_pdm_initialize(void)
{
  struct nrf52_pdm_s *priv;
  int ret;

  pdminfo("NRF52 pdm Initialize!\n");
  priv = &g_nrf52_pdm_priv;

  /* config peripheral registers */

  nrf52_pdm_config();

  /* config pins used by the peripheral */

  nrf_gpio_cfg_output(BOARD_PDM_CLK_PIN);
  nrf_gpio_pin_clear(BOARD_PDM_CLK_PIN);
  nrf_gpio_cfg_input(BOARD_PDM_DIN_PIN, NRF_GPIO_PIN_NOPULL);
  nrf_pdm_psel_connect(BOARD_PDM_CLK_PIN, BOARD_PDM_DIN_PIN );


  sem_init(&priv->exclsem, 0, 1);

  /* Initialize queue */

  dq_init(&priv->pend);
  dq_init(&priv->done);

  /* Initialize buffering */

  nrf52_pdm_buf_initialize(priv);

  /* Attach the pdm interrupt */

  ret = irq_attach(PDM_IRQn, nrf52_pdm_interrupt, priv);
  if (ret < 0)
    {
      auderr("ERROR: PDM irq attach failed: %d\n", ret);
      goto err;
    }


  return &priv->dev;

err:
  return NULL;
}

#endif



